CSI API ETABS v1
cAreaObj.GetProperty Method
 Retrieves the area property assigned to an area object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProperty(
	string Name,
	ref string PropName
)
Function GetProperty (
	Name As String,
	ByRef PropName As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim PropName As String
Dim returnValue As Integer
returnValue = instance.GetProperty(Name,
	PropName)
int GetProperty(
	String^ Name,
	String^% PropName
)
abstract GetProperty :
        Name : string *
        PropName : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined area object.
PropName
Type: System.String
 The name of the area property assigned to the area object. This item is None if no area property is assigned to the area object.
Return Value
Type: Int32
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim PropName As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get area property
   ret = SapModel.AreaObj.GetProperty("1", PropName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace